-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2017-05-04 11:04:04
-- 服务器版本： 10.1.21-MariaDB
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `jinghua`
--

-- --------------------------------------------------------

--
-- 表的结构 `admin`
--

CREATE TABLE `admin` (
  `id` int(1) NOT NULL,
  `name` char(11) NOT NULL,
  `password` int(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `admin`
--

INSERT INTO `admin` (`id`, `name`, `password`) VALUES
(1, 'bobo', 883762);

-- --------------------------------------------------------

--
-- 表的结构 `bbscomment`
--

CREATE TABLE `bbscomment` (
  `commentid` int(11) NOT NULL,
  `comment` tinytext CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `ctime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `bbsid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `bbscomment`
--

INSERT INTO `bbscomment` (`commentid`, `comment`, `ctime`, `bbsid`) VALUES
(1, '1111', '2017-04-21 10:04:32', 1),
(2, '11111', '2017-04-21 10:06:36', 1),
(3, '11111', '2017-04-21 10:06:41', 1),
(4, '111111111111111111111111111111111', '2017-04-21 10:06:52', 1),
(5, '1111111111111', '2017-04-21 10:12:52', 1),
(6, '1111111111111111111', '2017-04-21 10:23:57', 1),
(7, '22222\r\n222', '2017-04-26 06:32:07', 1),
(8, '22222 2222                   2', '2017-04-26 06:32:31', 1),
(9, '1111', '2017-04-26 07:10:48', 1);

-- --------------------------------------------------------

--
-- 表的结构 `bbspage`
--

CREATE TABLE `bbspage` (
  `bid` int(11) NOT NULL,
  `title` char(11) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `bbspassage` mediumtext CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `author` char(11) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `look` int(11) NOT NULL,
  `importance` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `bbspage`
--

INSERT INTO `bbspage` (`bid`, `title`, `bbspassage`, `author`, `time`, `look`, `importance`) VALUES
(1, '问个问题', '我为什么什么帅我为什么什么帅我为什么什么帅我为什么什么帅我为什么什么帅我为什么什么帅\r\n', '', '2017-04-21 07:38:10', 0, 0),
(2, '第二个题问题问题问题', '哈哈哈哈哈哈哈哈哈哈哈哈', '', '2017-04-21 07:40:10', 0, 0),
(3, '第三个问题', '今天天气正好', '', '2017-04-21 07:41:51', 0, 0),
(4, '第四个问题', '啦啦啦啦啦啦', '', '2017-04-21 07:42:12', 0, 0),
(5, '第五个问题', '呵呵呵呵', '', '2017-04-21 07:42:31', 0, 0),
(6, '第六个问题', '重中之重租住房数据地方比较卡的发货就好', '', '2017-04-21 07:42:52', 0, 0),
(7, '555', '5555555555555555555', '', '2017-04-26 09:09:59', 0, 0),
(8, '22222222222', '2222222222222222222222222222', '', '2017-04-26 12:46:45', 0, 0),
(9, '33333333333', '3333333333333333333333333333333333333333', '', '2017-04-26 12:47:10', 0, 0),
(10, '99999999999', '99999999999999999999999999999999999', '', '2017-04-26 12:48:39', 0, 0),
(11, '5555', '55555555555555555555', '', '2017-04-26 12:49:31', 0, 0);

-- --------------------------------------------------------

--
-- 表的结构 `comment`
--

CREATE TABLE `comment` (
  `commentid` int(11) NOT NULL COMMENT '评论号',
  `comment` mediumtext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '评论',
  `ctime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '评论时间',
  `passageid` int(11) NOT NULL COMMENT '文章号'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `comment`
--

INSERT INTO `comment` (`commentid`, `comment`, `ctime`, `passageid`) VALUES
(19, '你好啊', '2017-04-21 12:48:03', 0),
(20, '你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好', '2017-04-21 12:48:14', 0),
(21, '你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好v', '2017-04-21 12:48:27', 0),
(22, '你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好', '2017-04-21 12:48:43', 7),
(23, '你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好你好v', '2017-04-21 12:48:56', 5),
(24, '我是水水\r\n我是', '2017-04-21 12:55:01', 6),
(25, '我是说\r\n我我我', '2017-04-21 12:55:21', 6),
(27, '我是赵林波', '2017-04-23 07:02:22', 0),
(28, '11111', '2017-04-26 07:21:49', 7),
(29, '这是一行\r\n这是空格  这是空格\r\n  我前面有空格', '2017-04-26 07:23:44', 0),
(31, '这是一行\r\n这是空格  这是空格\r\n  我前面有空格', '2017-04-26 07:24:01', 0);

-- --------------------------------------------------------

--
-- 表的结构 `passage`
--

CREATE TABLE `passage` (
  `pid` int(255) NOT NULL COMMENT '文章号',
  `title` char(50) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '文章标题',
  `passage` mediumtext CHARACTER SET utf8 COLLATE utf8_bin COMMENT '文章内容',
  `author` char(10) CHARACTER SET utf8 COLLATE utf8_bin DEFAULT NULL COMMENT '作者',
  `time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '时间',
  `look` int(255) NOT NULL,
  `comcount` int(255) NOT NULL,
  `importance` tinyint(1) NOT NULL DEFAULT '0' COMMENT '精选'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `passage`
--

INSERT INTO `passage` (`pid`, `title`, `passage`, `author`, `time`, `look`, `comcount`, `importance`) VALUES
(0, '我是标题', '我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容', '管理员', '2017-04-14 07:31:39', 100, 10000, 1),
(1, '我是标题', '我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容我是内容', '管理员', '2017-04-14 07:31:52', 100, 10000, 1),
(2, '三月，醉一场青春的流年', '三月，醉一场青春的流年。慢步在三月的春光里，走走停停，看花开嫣然，看春雨绵绵，感受春风拂面，春天，就是青春的流年。青春，是人生中最美的风景。青春，是一场花开的遇见；青春，是一场痛并快乐着的旅行；青春，是一场轰轰烈烈的比赛；青春，是一场鲜衣奴马的争荣岁月；青春，是一场风花雪月的光阴。\r\n \r\n　　青春往事，多么甜蜜；青春岁月，多么靓丽；青春流年，如火如荼。青春里，我们向着梦想前进。跌倒过，伤心过，快乐过，痛苦过，孤独过，彷徨过，迷茫过。总是，在悠悠的岁月中徘徊；总是，在如春的生命中成长；总是，在季节的交替中感悟人生四季的美妙与韵律；总是，在多愁善感中体悟青春的美好与无奈。\r\n \r\n　　三月的鲜花，一树树，一束束，一簇簇，而青春，就是像三月的鲜花一样美丽迷人，生机盎然，姹紫嫣红，生机勃勃。三月，是青春里最美最温暖的风景。三月的美，就像青春的美，充满活力，充满生机，充满昂扬的斗志。三月的美，就像青春的花季，在那里我们可以感受青春的跳动与感动，感受青春的曼妙与奇妙；感受青春的悸动与心跳。\r\n \r\n　　青春，如三月的春光，安暖向阳。在美丽的青春年华，我们手牵手，肩并肩，跨过岁月山河，跨过锦瑟流年，跨过天涯海角，在三月的春光里沐浴金色的光泽。三月的春光，让青春的我们看到希望，看到自己有一颗年轻跳动的心，看到蓝天白云，看到明媚的灿烂。三月的春光，温暖无比，就像我们的青春，有着长辈的呵护，有着老师的循循教导，它们就像春光，照耀着我们年轻的心。\r\n \r\n　　青春，如三月的春雨，我们在春雨中得到滋润。春雨，淅淅沥沥，纷纷扬扬，打在青春的雨季，打在我们心里，打在我们的生活里，打在我们的生命中，打在我们的灵魂深处。一场春雨，滋润着我们的青春流年，让我们快乐成长，让我们如沐春雨，让我们感受亲恩。三月的春雨，就像我们的父母，用他们的爱心，滋润着我们幼小不安的心灵。\r\n \r\n　　青春，如三月的春风，我们沐浴在春风里。三月的春风，是我们的朋友，是我们的同窗，是陪伴我们成长的玩伴。因为有了春风，我们感受到友谊的温暖；因为有了春风，我们不再寂寞；因为有了春风，我们总在需要帮助的时候，有他们伸出援助之手。春风，是那样感情丰富，温婉细腻。在春风里，我们跳着，唱着，欢呼着，只因为这如春风的情谊。\r\n \r\n　　青春，如三月的春花，我们陶醉在春花里。三月的春花，是我们的初恋。花开半夏，岁月静好，浅笑安然。三月春花，有着不同的颜色，不同的形状，不同的意向。那水灵灵的粉红的桃花，恋着春风，恋着春雨； 那纯白娇小的茉莉，散发着淡淡的清香；那深红的杜鹃，像燃烧着红色的火焰。初恋，是一种颜色鲜艳的花朵；初恋，是一种幽幽的馨香；初恋，是一种岁月的沉淀。\r\n \r\n　　青春，是三月的风景，美到极致。我们，在三月的春雨中奔跑嬉戏，在春风中感受它的温润，在春光里感受暖暖的温度，在春花里享醉人的芬芳。三月的风景，陪我们一路向梦想的地方进发；三月的风景，让我们路上不再孤独，不再迷茫，不再彷徨；三月的风景，让我们的青春更加色彩斑斓，鸟语花香。\r\n \r\n　　三月，醉一场青春的流年。我们珍惜三月，就像我们珍惜来之不易的幸福青春。三月的雨，三月的风，三月的春光，三月的花香，让我们沉醉不知归路，兴尽晚回舟。在这样一场盛大而清新的流年，我们懂得，青春是一种一去不复返的风景，应当好好保护；青春是一种美丽而活跃的热情，我们必须耐心保持；青春是一种来之不易的懂得，我们必须细心呵护。\r\n \r\n　　三月，醉一场青春的流年。风过无痕，花开向暖。无论是哪一年的三月，都是青春是里最美丽的花朵，都是青春里最难舍的风景，都是青春里最妩媚的清香。无论在哪一年的三月，无论我们有没有老去，心中的青春千万不能割舍，心中的青春永远跳动着快乐，心中的青春永远伴随我们一生一世。\r\n \r\n　　三月，醉一场青春的流年。人生的三月，我们正值青春，风华正茂。在这样一个充满活力的年纪，我们要把握机遇，朝人生的巅峰冲刺；我们要珍惜每一个让我们流连忘返的风景，保持年青的心态，随时准备着与时间赛跑；我们要在时光深处，保持一种淡然而洒脱，矜持而深情的微笑，让三月的风景陪我们笑语盈盈，清芬一路', '管理员', '2017-04-26 12:10:18', 0, 0, 1),
(3, '情镌三分木，相思万骨书', '几渚梁梦杯中尽，独影朱阁泪成诗？万里婵娟银河坠，星辰似海踏歌来。故梦千里清铃响，静候梵音斩红尘。——题记。\r\n \r\n　　那一世，你在这场缠绵的夜雨江南中为他悄悄的撑起那把泛青的油伞；我亦在烽台烛台望你千年之余，我曾听闻你为寻他走遍了千迢万里，踏过了雨雪绯林；而今离他只有那短短的一步之遥。看见你为了他在雨中温柔静候，那眼角滑落下的液体伴随着倾赋予他的漫天思念；静静的洒满这座城市的每一个角落。而我就这样静静的站在你们身后，多余的像极了一幅煞乱风景的残墨；顷刻间充斥着幸福流淌过的每一条暖流。但你是否曾知晓？那雨水从天而降肆无忌惮的在我的脸颊划落；泪水也参杂在雨水里紧附着思念随波逐流的晕开视线里残留下的最后一幅画面。也许你永远都不会知道，今生的我为了等候你那不轻易的回首；似乎比你等他的时间还要长。\r\n \r\n　　听人说一个人的时候，温起壶中酒；独倚拜月楼，望着庭中盛放的满院流光；凄冷的冬风定会静静的摇落下一地的相思，只为承载起那些忧伤孤独的过往，在岁月的年轮中不停的刻圈成画；却始终画不到那个所谓的终点。有你的曾经一直潜藏在故事里蔓延着最为凄美的片段，梦中的枯藤已千年不绿；被风吹干后的答案；夺走了彼此记忆中最为动人的拥抱。那些禁锢在心底深处的怅然，冲淡了相聚时的喜悦与快乐；难以掩盖的忧伤中载满了无法清点不舍与难过。\r\n \r\n　　人生短短十数载，梁月何时绕梦中？当彼此的相遇早已为离别埋下了深深的伏笔，当插肩而过时也不会在为过客不留的画面挽留下最后一丝温存；回忆总是美的让人心碎，曾经的过往依旧使人这般沉吟至今。或许那般留恋本不应该赖在记忆中，转进我心里霸占着每一寸缝隙。\r\n \r\n　　冬日春雨几月寒，半阕红豆怎续情？望穿了奈何秋水，我们终究还是等不到那不期而遇的再见。少了梦里梦外的花开，你说着曾经的相遇是如此的云淡风轻，我想着坐拥过着有你的岁月铅华；那时的我梦中藤萝不香醒，梦醒时节花落西厢。敛一轮皓月星空，抒一卷痴情惘然。怎奈文字铺垫的岁月里依旧美轮美奂，不禁让人再次心涌执念；荡漾起那假睡着的海誓山盟。我曾想待你拂去我眉宇间的忧愁，我愿牵起你的手浪迹天涯。最为灿烂的爱情，过界后也不过是烟花转瞬繁落一季。真正的爱情必然是经得起流年锦瑟的厮守，相伴过帘卷云舒的夕霞；也会共赏着烟雨散尽后的那一池澄碧。而此时的冬风枯叶镌落下一地的旧识；我假想着此刻正轻抚着你过肩的云松螺鬓，陪你在冬意的余寒中挑烛研墨执笔千笺。\r\n \r\n　　在你离开的那些日子里，我想象着自己就是那个等待春意复苏的枯藤；初心不变静待春意再临，我定会义无反顾的泛起那些早已枯尽的条条枝桠，缀满在这整个的望穿湖畔。我想用尽此生珍藏着余留下的每一份思念，我会用尽所有的相思化作朝曦照射在你梦想开始的地方。我相信执着不变的承诺，亦会换来再次的相遇。举起杯中酒，泼尽研中墨；月光下丝竹悠扬，但却未能入梦。 树心的年轮刻落了多少岁月的年华，漫无边际的回忆里垂落下多少欢声的细语；吻过的红唇言诺过多少的至死不渝？当我再次怀揣着仅剩的勇气轻轻推开那扇记忆的门扉时，又有谁会安静的站在门外嘴边轻扬起肆意的笑窝？一那双动人的眼眸中溢满出难以掩藏的等候，我想那时我的身边定会悄然泛起爱情的轨迹；那些让我无法用文字去代替的情愫，悄悄的镌入菩提三分木，执笔千章万骨书。', NULL, '2017-04-14 15:27:47', 0, 0, 0),
(4, '人总要学会在深夜跟往事和解，晚安即释怀', '每个深夜都是矛盾体在释放，忍住了，你是天使；忍不住，你是恶魔。\r\n \r\n圣诞结，嗯，我没写错，不是圣诞节；\r\n有些事，解得开，是结，解不开，是劫；\r\n对于橘子来说，似乎每一场喧嚣的节日，都像是形单影只煎熬的渡劫；\r\n热闹是别人的，她什么也没有，就像奶茶歌里唱得“一群人的狂欢一个人的孤单……”\r\n \r\n快两年了……时间这个狡猾的骗子，所有一切掩藏的毫无痕迹，伤痛仿佛快要被治愈，却又慢慢衍生着新的伤痛慢慢入侵，像个后发制人的突击者，毫无防备，瞬间击杀，随之崩塌。\r\n \r\n我一直以为，她笑得那么开心，一定从病房走出来了。原来，坚强，不过是温柔生的茧。\r\n \r\n平安夜，很多朋友邀橘子出去嗨，看电影、蒸桑拿、飙车去外滩、K歌、吃饭…后来她统统推掉，说回家陪父母。本以为回家了就能好一些，可是敲门没人应，自己拿钥匙开门，家里空无一人…憋了一天的情绪仿佛找到一个泄洪口，一下子爆发，然后再也守不住。橘子又掉眼泪了！！甩掉背包、脱掉棉衣，跑进房间坐地上就哭，也不知道哪来这么多委屈，哪来这么多眼泪…这个平安夜真的平静又安静……\r\n \r\n或许，她没有走出内心的阴霾。一到深夜，橘子就会释放自己的恶魔，变成另一个自己。我问，她只说没事。后来，我装作知道，又装作不知道，静静的看着黑夜沉沦的另一个橘子。只是，夜尽天明，她若无其事的样子，真得好令人心疼。\r\n \r\n前任和她说：“在我们的事情上，确实错在我，那么优秀的你，该过好的生活。我希望你好，也希望有那么样的机会以最最最好朋友的身份照顾你陪着你！”\r\n \r\n看着橘子的记录，黄莲味的心酸缱绻在舌尖，吃了大半个橙子，嘴里还是觉得有些涩，就像你听见有一个异性对你说“你是个好人”一样。\r\n \r\n我们诚惶诚恐，我们小心翼翼，我们毫无保留，却不一定就能把爱，变成相爱。如果这一次真得背过身我们不再遇见了，那我希望我们可以面对面再背对背，永远不留遗憾，一生山高水阔。只是，后来，我们都甘愿被生活凌迟。\r\n \r\n大道理，橘子都懂，只是安慰别人的话劝不了自己。橘子说，我不怪他，我也不会再需要他。可有时候，你会觉得谁都可以，又觉得谁都不可以。\r\n \r\n就像曾经的那段日子\r\n“早”，“晚安”\r\n一天，甜蜜的开始，幸福的结束。\r\n后来，只有冷冷的早晨，\r\n没有了夜里的温暖。没有了晚安\r\n后来，再也没有了后来\r\n \r\n我们熟悉的习惯，突然被抽离的时候，你会觉得少了什么，可又说不出是什么，只知道，有一种空落落，让自己夜夜辗转难侧。\r\n \r\n就像等得公交没有按时来，点得外卖拖了一刻又一刻  \r\n \r\n \r\n我们都像是上了桌的赌徒，从未想着输着离开\r\n我们不是在逞强，只是忘记了怎么软弱；\r\n于是，夜里，都变成了自己的吸血鬼。\r\n \r\n橘子，记得，难过的时候，嘴里含一颗糖\r\n \r\n你的眼睛，辣么好看\r\n适合装下所有深情\r\n \r\n你的鼻子，辣么好看\r\n适合闻爱情的味道\r\n \r\n你的手，辣么好看\r\n适合牵着到老\r\n \r\n你的耳朵，辣么好看\r\n适合听上一生的情话\r\n \r\n脱缰的马不是好马，宝马跑了，你会有奥迪的\r\n深夜，是和往事和解的咖啡屋，晚安即释怀', NULL, '2017-04-26 12:10:26', 0, 0, 1),
(5, '陪母亲磨面', '快过年了，母亲决定回老家淘麦磨面。今冬把父母亲接过来一起住后，家里的面吃得格外费，勤劳的母亲照顾完父亲和小女儿后，坚持压面条、蒸馍吃，母亲说：“买的面条馍没面味儿。”再加上妹妹一家要从广州回来过年，母亲坚决不让买面，执意要回老家磨面，我知道母亲是想让千里之外的女儿吃上自己亲手磨的面。\r\n \r\n在一个晴朗的周末，我早早地陪母亲回了老家。家里虽有邻居的照看，仍缺了点人气。我先帮母亲把院子打扫干净，然后从厢房的粮仓中拿出筛子和薄箩等淘麦工具，看着粮仓靠墙的一排粮缸，我觉得既熟悉又陌生，我已想不起来自己上一次进粮仓是哪一年的事了。打开一缸压得严严实实的麦缸，母亲抓起一把麦子放在手掌间揉搓着，沙沙作响。“这是去年的麦子！”母亲自言自语，像摩挲着自己的孩子，脸上放着光芒。母亲说新麦暴，陈麦好吃养人，家里总存着二三年的麦子。小时候，母亲经常说的一句话就是“家中有粮心里不慌”，随着年龄的增长，阅历的丰富，母亲那简单的话语里蕴含着做人的哲理，只有自己内心富足了，才能在岁月的洗练下沉静、悦己、怡人。\r\n \r\n淘麦子就是把麦子倒入一个盛满清水的大盆里，水要满而不溢，麦子要完全沉入水中，只见母亲先用笊篱伸入水中的麦子里充分搅动几圈后，麦子里混杂的麦壳等杂物就浮到了水面上，母亲用笊篱把浮在水面的麦壳捞干净后，用笊篱水平在水面沿盆沿顺时针划圆，水中的麦子就听话地排起队，跟着母亲的笊篱舞动起来，麦子中混杂的小石子等杂物就留在了盆底，等水中的麦子舞得正欢时，母亲灵巧得把笊篱后沿往下一倾，突然停止转动，麦子就鱼贯而入到笊篱中。母亲就这样一笊篱一笊篱地捞满一筛子，由我端起倒入放在小桌上的大薄箩里，用一大块白棉布蒙在手上，插入麦子里反复正反转着圈擦，擦一会儿把棉布掂起来，抖落上面的麦子，拧干再擦，如果拧出来的水浑浊，就把棉布洗干净再擦，直擦到棉布拧不出水，就可以把麦子摊到反铺的竹席上晾晒了。没多大一会儿，两袋麦子就淘完了。母亲一边收拾家什儿一边说：“现在的麦子都是机器收得，干净，不像麦场上打的那么脏，好淘。”看着阳光下泛着金光的麦子，母亲脸上洋溢着幸福的笑容，我的心里也体验到了一种久违的踏实。\r\n \r\n在五叔家吃过午饭，唠了一会儿家常，太阳已经偏西，冬天天短，我和母亲就动手收拾，装好麦子往城里赶，天黑前赶到了家。\r\n \r\n磨面用的是机器，相对轻松，只是找磨面的磨坊倒费了一番周折，多方打听，才在远郊的一个偏远村子找到了一个小磨坊，幸好麦子湿，又在冬日的小院里晾晒了两天才拉去磨。看着雪白的面粉，母亲脸上的笑容愈发灿烂了。我要把磨好的面粉搬到车上，母亲不让，母亲说：“你没干惯活，别弄脏衣服，咱俩抬着。”\r\n \r\n在我弯腰和母亲抬面粉的刹那，母亲的白发像针尖一样刺在我的心上，生生地疼。每次母亲都准确地计算好我回老家的时间，把要带的油、面等菜蔬准备得停停当当，做好好吃的等着我们，而我总是匆匆地回、匆匆地去，不是工作忙，就是孩子要上辅导班，从来没考虑过那菜和面里饱含着母亲多少的艰辛。父母为我们付出了那么多，已经身为人父的我，又为父母做了些什么呢？今年春节可以和父母在一块儿过年了，我想关掉手机、关闭微信、宅在家里，跟母亲学做两样家常菜，陪父亲好好唠唠……', '游客', '2017-04-26 12:10:35', 99, 99, 1),
(6, '阳春三月', '二月如奔驰的马驹，一晃而过。三月带着一股兴盛的动态，强势入住。三月是有力量的，它不容忽视。\r\n\r\n春天在三月里已经丰富饱满，那些生长出来的绿意，在一夜间，就多了许多。\r\n\r\n“阳春百日风在香”，三月的微风带着俏皮吹拂在脸颊，温和的如少女的发丝，飘动着春天里特有的气息。走在三月的风中，有股特别渴望奔跑的想法。我们都经历过逆风飞翔的困难，我们也经过过迎风奔跑的快意。你在风中的样子，最美。\r\n\r\n三月的雨是带着丝线的细，穿透心底的清幽，滋润着大地。小草，野花，树叶，绿枝，还有撑着雨伞的的人。在三月的雨中，是适合思念一个人的。“人间三月雨和尘”，三月的雨带着清凉缠绵，一来就会润了心田。一场雨后，更多春生。\r\n\r\n三月的花，是迷人的。在花海里，抬头间，鼻尖就会触碰着花朵的温柔。颔首处，扑鼻而来的香氛，流动在身边。忍不住的想去，与花共眠。写不尽的花意，流水也在等待着花的垂爱。花期到了，满树的花蕊，把春天装扮的格外美丽。\r\n\r\n在三月里，遇到的人，也都是那么美好的。褪去了厚重的棉衣，每个人都是友好的。每一次相逢，都值得尊重。一定会有人，对你无条件的好，因为这些人懂得你的好。\r\n\r\n更有知交，在你遇到困难的时候，如三月里的阳光，给予你无限的勇气和战胜困难的力量。不是每一段路程都布满鲜花，泥泞处，拉你一把的人，是尊贵的。明媚的三月，让一切都不是问题。\r\n\r\n“时在中春，阳和方起。”到了三月，才真正的暖和起来，可以着单薄的春装。草木也正在翻动绿意，一眨眼，就看到了新芽。\r\n\r\n三月，是个美丽的时节。草长莺飞时，值得去奋斗。', '游客', '2017-04-15 08:41:11', 98, 98, 1),
(7, '将欲取之，必先予之', '外面，突如其来的刀光把天空劈成两半，天空为之一破，瞬间浓云密布，天地陡暗。子弹般的雨从天空深处扫下，攻击着我安乐的居所。\r\n居所里，好多美味的食物，触手可及，我可以在其中尽情享乐。那剪断阳光的盖子为我挡下雨的侵袭，我在里面悠哉悠哉，不用为食物而顾虑，不用被天敌所追杀。可这里，除了黑暗，依旧，黑暗。除了食物，还是食物，世界那么大，我想去看看，去看看那水彩未干的天空，去听听那来自大自然的潺潺呢喃，去嗅嗅那花儿身上的馥郁香息。\r\n       所以，我要冲破，这黑暗的囚笼，就算头破血流，就算，舍弃这满满的食物和安全感，就算，饿死，被杀死，哪怕，头破血流。所以，再见，食物们，我——要出去。\r\n       看着这满满的食物，不觉饿了，不觉贪了，有点恶心了，它们贪婪地勾住我的欲望时，我更觉恶心了。我开始觉得，这绝不是一个安乐所，而是一个地狱!这个地狱里有许多贪婪而丑恶的“僵尸”，渐渐榨食你的信念，它们原形毕露了。我看着这些伪装者，哦！天哪，不要看它们，会诱惑你的，它们太美味了，舍弃它们，一定要出去！\r\n       那黑暗的上空，挤进一束光线，我不屑地看着它们，朝那方向去了。当我挥舞着翅膀冲向天空时，前方是一面无形的墙，我被挡住了，没有去路，留给自己的，是一片无助的黑。下方，一片腐烂的罪恶，我好饿，好累，它们，它们好香，不！不要看！舍弃！舍弃它们！\r\n       很久，雨下得很久很久。而我，撑着那片封闭的天，不断喘息，满身狼狈。一扭头，又能看见它们戴着天使的伪具向我招手。筋疲力尽的我，俯看它们，又像一个恐怖的黑洞，使劲地，使劲地把我往下吸，而我，使劲逃脱着，逃脱着。\r\n       当一个倒立着的塑料瓶倒了，在一个垃圾房里，一个黑点趁此冲向了那天空的蔚蓝，悄无——声息。\r\n       刺痛扔像烟气般缠绕在我软绵绵的躯体上，但我看见了水彩未干的天空，像梦一样温柔的风儿，潺潺的水声以及芬香的花朵，我看见身后，那被我舍弃的食物们，不再后悔，因为我拥有了生存的斗志，我会拥有更多，得到更好。\r\n       我自由地飞行着，尽情享受阳光的抚摸，不时便有猎物撞入自己的视线，或许是敌人。我会因找不到食物而忧虑，会因敌人的追杀而逃命，自己是捕食者，也是被捕食者。我不再恐惧:\r\n因为，将欲取之，必先予之。\r\n        因为，我想要得到什么，必先，付出什么。\r\n因为，我舍弃了，那一瓶该舍弃的，得到了一个世界，全新的，一个不该舍弃、逃避的世界，是多么美好。\r\n外面，突如其来的刀光把天空劈成两半，天空为之一破，子弹般的雨从天空深处扫下，一个小黑点躲在一团深绿下，驻赏，这世界的美好。', '游客', '2017-04-15 08:41:04', 97, 97, 1),
(8, '春意，暗香', '初春，暖意未感，寒意依然，心思徘徊在昨天。人物依稀，拾起记忆已不见初识情怀，不见想念，相见恨晚，满怀你侬我侬已被现实击碎，各走一方，渐远渐消散。\r\n　　小楼逸居，静观花儿绽放，嗅闻阵阵芬香，月夜添曲，风儿传来阵阵情歌，美好时光定位在那一刻，现今收拾起情绪封存。\r\n　　春意，总使人遐想，向往与大自然融为一体，陈年往事已远，不提，无殇，新起点静待迷离眼眸看穿世事沧桑。曾几何，太在意也无法挽留，放手回落安然。时光无限好，随景移不纠缠，年年花事近相似，人物更改已花非花，雾非雾，隐忍一笑，无需纠结适应了人间烟火。\r\n　　惊叹小草的通幽之术，无论外界有多少未知，春来破土摇曳。无论风雨来临有多少未知癫狂，雨来低头，日出昂头；风来四面倒，依然笑对风雨声。花开花落不悲怀，欣然接受生活给予的百般滋味。\r\n　　春来，赏百花，满眼绿意懂得生命珍贵；夏来，抛开束缚，抵得住严酷，怜悯自然界事物。秋来，收获丰硕，别忘困境疾苦，珍惜这份缘分；冬来，底蕴暗藏，因知道，来年春光谁也挡不住，依然释放葱郁点缀。\r\n　　花儿娇艳，却很短暂，时不时被外界缩减了生命。也许，寓意美好事物不长久，疏忽的往往在身边。\r\n　　春光渐暖，窗外枝条吐绿，抑制不住心情大好。只因，看破红尘事，犹如四季轮回，曲折路久困坚持不懈渐能安。\r\n　　音乐缭绕，一段段往事尘封，活在当下惜缘之人，无需花言巧语，只要一个眼眸，从此无怨无悔紧握双手，为你改变小任性，苦乐相陪不离不弃便是无限幸福，最快乐的事。', '游客', '2017-04-15 07:06:01', 96, 96, 0),
(9, '第一篇通过编辑页面发布的文章', '我是来测试一下的回车\n  我的前面有两个空格  我的后面有两个空格回车\n                 我的前面一堆空格', NULL, '2017-04-26 08:20:03', 0, 0, 0),
(10, '1111111111', '11111111111111111111111111', NULL, '2017-04-26 08:23:31', 0, 0, 0),
(11, '2222', '22222', NULL, '2017-04-26 08:29:16', 0, 0, 0),
(12, '3333', '33333333333333333', NULL, '2017-04-26 08:37:32', 0, 0, 0),
(13, '4444444444444', '44444444444444', NULL, '2017-04-26 08:39:56', 0, 0, 0),
(14, '4444', '44444', NULL, '2017-04-26 08:40:53', 0, 0, 0),
(15, '1111111', '333333', NULL, '2017-04-26 08:42:42', 0, 0, 0),
(16, '55555555555555', '555555555555555555555555555555555', NULL, '2017-04-26 08:43:12', 0, 0, 0),
(17, '5555555555555555555', '5555555555555555555555', NULL, '2017-04-26 08:47:15', 0, 0, 0),
(18, '666666666', '666666666666666666', NULL, '2017-04-26 08:47:39', 0, 0, 0),
(19, '77777', '777777777777777', NULL, '2017-04-26 08:48:14', 0, 0, 0),
(20, '11111111111111111', '1111111111111111111', NULL, '2017-04-26 12:10:49', 0, 0, 1),
(21, '99999999', '99999999999999999', NULL, '2017-04-26 12:10:41', 0, 0, 1),
(22, '99999999', '99999999999999999', NULL, '2017-04-26 08:50:08', 0, 0, 0),
(23, '99999999', '99999999999999999', NULL, '2017-04-26 08:50:12', 0, 0, 0),
(24, '11111111111111', '11111111111111111', NULL, '2017-04-26 08:52:14', 0, 0, 0),
(25, '5555555', '5555555555555555555', NULL, '2017-04-26 08:53:22', 0, 0, 0),
(26, '999999999999999999999999', '99999999999999999999999999999', NULL, '2017-04-26 08:53:43', 0, 0, 0),
(27, '5555555555555', '55555555555555555555', NULL, '2017-04-26 08:55:56', 0, 0, 0),
(28, '999999999999', '99999999999999999999', NULL, '2017-04-26 09:01:27', 0, 0, 0),
(29, '1111111111111111111111111', '11111111111111111111111111', NULL, '2017-04-26 09:06:05', 0, 0, 0),
(30, '5555', '555', NULL, '2017-04-26 09:07:19', 0, 0, 0),
(31, '99999999999999', '99999999999999999999999', NULL, '2017-04-26 09:08:33', 0, 0, 0),
(32, '555555', '555555555555555555555555555', NULL, '2017-04-26 12:50:38', 0, 0, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `bbscomment`
--
ALTER TABLE `bbscomment`
  ADD PRIMARY KEY (`commentid`);

--
-- Indexes for table `bbspage`
--
ALTER TABLE `bbspage`
  ADD PRIMARY KEY (`bid`);

--
-- Indexes for table `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`commentid`);

--
-- Indexes for table `passage`
--
ALTER TABLE `passage`
  ADD PRIMARY KEY (`pid`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `admin`
--
ALTER TABLE `admin`
  MODIFY `id` int(1) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- 使用表AUTO_INCREMENT `bbscomment`
--
ALTER TABLE `bbscomment`
  MODIFY `commentid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
--
-- 使用表AUTO_INCREMENT `bbspage`
--
ALTER TABLE `bbspage`
  MODIFY `bid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
--
-- 使用表AUTO_INCREMENT `comment`
--
ALTER TABLE `comment`
  MODIFY `commentid` int(11) NOT NULL AUTO_INCREMENT COMMENT '评论号', AUTO_INCREMENT=32;
--
-- 使用表AUTO_INCREMENT `passage`
--
ALTER TABLE `passage`
  MODIFY `pid` int(255) NOT NULL AUTO_INCREMENT COMMENT '文章号', AUTO_INCREMENT=33;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
